# Taps
tap 'homebrew/bundle'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'bash-completion'
brew 'curl'
brew 'fontconfig'
brew 'gcc'
brew 'git'
brew 'gnuplot'
brew 'golang'
brew 'graphicsmagick'
brew 'imagemagick'
brew 'lua'
brew 'lynx'
brew 'node'
brew 'openssl'
brew 'pkg-config'
brew 'tree'
brew 'postgresql'
brew 'wget'

# Apps
cask 'alfred'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'vlc'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Quicklook
cask 'betterzipql'
cask 'qlimagesize'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'skyfonts'
