# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/science'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'bash-completion'
brew 'cowsay'
brew 'curl'
brew 'epstool'
brew 'fontconfig'
brew 'gcc'
brew 'git'
brew 'gnuplot'
brew 'graphicsmagick'
brew 'hub'
brew 'imagemagick'
brew 'lua'
brew 'lynx'
brew 'mackup'
brew 'memcached'
brew 'mongodb'
brew 'node'
brew 'openssl'
brew 'pyenv'
brew 'pkg-config'
brew 'ruby'
brew 'the_silver_searcher'
brew 'sqlite'
brew 'trash'
brew 'tree'
brew 'octave'
brew 'postgresql'
brew 'python3'
brew 'wget'

# Apps
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'chromecast'
cask 'cyberduck'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'fluid'
cask 'goofy'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'heroku-toolbelt'
cask 'iterm2'
cask 'mysql'
cask 'mysqlworkbench'
cask 'rescuetime'
cask 'screenhero'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'tunnelblick'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'betterzipql'
cask 'qlimagesize'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'skyfonts'
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
